package com.example.bluetooth.le;

/**
 * Created by Administrator on 2018/04/21.
 */

public interface Contant {


    String printDataCeshi1 = "";

    String printDataCeshi="SPEED 3\n" +
            "DENSITY 6\n" +
            "DIRECTION 1\n" +
            "SIZE 80.00 mm,60.00 mm\n" +
            "GAP 0.00 mm,0.00 mm\n" +
            "CLS\n" +
            "REFERENCE 0,0\n" +
            "PRINT 1,1\n";

    String getPrintDataCeshi3 = "SPEED 6\n" +
            "DENSITY 8\n" +
            "SET PEEL OFF\n" +
            "SET CUTTER OFF\n" +
            "SET PARTIAL_CUTTER OFF\n" +
            "SET TEAR ON\n" +
            "DIRECTION 1\n" +
            "SIZE 100.00 mm,115.00 mm\n" +
            "GAP 0.00 mm,0.00 mm\n" +
            "OFFSET 0.00 mm\n" +
            "SHIFT 0\n" +
            "REFERENCE 0,0\n" +
            "CLS\n" +
            "BOX 57,562,766,868,2\n" +
            "BOX 58,22,763,483,2\n" +
            "BAR 57,780,708,2\n" +
            "BAR 57,823,706,2\n" +
            "BAR 422,565,2,301\n" +
            "BAR 57,675,708,2\n" +
            "BAR 59,232,703,2\n" +
            "BAR 490,233,2,247\n" +
            "BAR 565,232,2,247\n" +
            "BAR 491,357,270,2\n" +
            "BARCODE 238,55,\"39\",80,0,0,2,6,\"12345678\"\n" +
            "TEXT 238,143,\"TSS24.BF2\",0,1,1,\"12345678\"\n" +
            "TEXT 105,262,\"TSS24.BF2\",0,2,2,\"12345678\"\n" +
            "TEXT 115,318,\"TSS24.BF2\",0,2,2,\"12345678\"\n" +
            "TEXT 115,380,\"TSS24.BF2\",0,2,2,\"12345678\"\n" +
            "TEXT 502,268,\"TSS24.BF2\",0,1,1,\"客户\"\n" +
            "TEXT 504,306,\"TSS24.BF2\",0,1,1,\"签字\"\n" +
            "TEXT 503,380,\"TSS24.BF2\",0,1,1,\"应收\"\n" +
            "TEXT 504,420,\"TSS24.BF2\",0,1,1,\"金额\"\n" +
            "TEXT 597,404,\"TSS24.BF2\",0,1,1,\"￥4.00\"\n" +
            "BARCODE 493,579,\"128M\",66,0,0,2,6,\"!10512345678\"\n" +
            "TEXT 493,653,\"3\",0,1,1,\"12345678\"\n" +
            "TEXT 67,578,\"TSS24.BF2\",0,1,1,\"备注：\"\n" +
            "TEXT 63,685,\"TSS24.BF2\",0,1,1,\"寄方信息：\"\n" +
            "TEXT 96,726,\"TSS24.BF2\",0,1,1,\"12345678\"\n" +
            "TEXT 429,699,\"TSS24.BF2\",0,1,1,\"付款方式：寄付\"\n" +
            "TEXT 427,737,\"TSS24.BF2\",0,1,1,\"应收金额：￥2.00\"\n" +
            "TEXT 157,790,\"TSS24.BF2\",0,1,1,\"托寄物\"\n" +
            "TEXT 460,792,\"TSS24.BF2\",0,1,1,\"数量\"\n" +
            "BAR 563,781,2,86\n" +
            "TEXT 595,791,\"TSS24.BF2\",0,1,1,\"重量\"\n" +
            "PRINT 1,1\n";

           String cpclFont = "! 0 200 200 400 1\n" +
                   "PAGE - WIDTH 560\n" +
                   "SETBOLD 0\n" +
                   "JOURNAL\n"+
                   "TEXT 2 0 300 0 打印字体(2,0)\n" +
                   "TEXT 3 0 0 0 打印字体(3,0)\n"+
                   "TEXT 4 0 300 100 打印字体(4,0)\n"+
                   "TEXT 5 0 0 100 打印字体(5,0)\n"+
                   "TEXT 6 0 300 200 打印字体(6,0)\n" +
                   "TEXT 7 0 0 200 打印字体(7,0)\n" +
                   "TEXT 55 1 180 50 打印字体(55,1)\n" +
                   "PRINT\n";

    String cpclTest ="! 0 200 200 300 1\r\n" +
            "PAGE - WIDTH 560\r\n" +
            "JOURNAL\r\n"+
            "TEXT 4 3 150 0 123456789 ABCDEFGHI\r\n" +
            "TEXT 4 0 160 50 珠海浩盛打印机公司\r\n" +
            "BARCODE 128 1 1 45 10 130 000000000000001\r\n" +

            "TEXT 4 0 300 135 这是一个测试页\r\n" +
            "SETBOLD 1\n" +
            "B QR 0 0 M 1 U 5 \r\n" +
            "H,12345678\r\n" +
            "ENDQR\r\n" +
            "FORM\r\n" +
            "PRINT\r\n";

    String M320cpclTest ="! 0 200 200 1400 1\n" +
            "PAGE - WIDTH 560\n" +
            "GAP-SENSE\n" +
            "LINE 0 90 560 90 2\n" +
            "LINE 0 170 560 170 2\n" +
            "LINE 0 215 560 215 2\n" +
            "LINE 0 345 560 345 2\n" +
            "LINE 0 445 560 445 2\n" +
            "LINE 0 555 560 555 2\n" +
            "LINE 0 675 560 675 2\n" +
            "LINE 0 785 560 785 2\n" +
            "LINE 0 885 560 885 2\n" +
            "LINE 0 985 560 985 2\n" +
            "LINE 0 1100 560 1100 2\n" +
            "LINE 0 1180 560 1180 2\n" +
            "LINE 0 1260 560 1260 2\n" +
            "LINE 470 10 470 90 2\n" +
            "LINE 40 215 40 445 2\n" +
            "LINE 40 785 40 985 2\n" +
            "LINE 40 1100 40 1260 2\n" +
            "LINE 110 555 110 675 2\n" +
            "LINE 460 555 460 675 2\n" +
            "SETBOLD 1\n" +
            "TEXT 4 0 480 12 标\n" +
            "TEXT 4 0 520 12 准\n" +
            "TEXT 4 0 480 52 快\n" +
            "TEXT 4 0 520 52 递\n" +
            "SETBOLD 0\n" +
            "TEXT 4 3 10 100 01 02 03（测试打印）\n" +
            "TEXT 4 0 40 175 浙江杭州南星桥公司\n" +
            "SETBOLD 1\n" +
            "TEXT 4 0 2 260 收\n" +
            "SETBOLD 0\n" +
            "TEXT 4 0 2 380 寄\n" +
            "TEXT 4 0 50 220 火先生 13800001111\n" +
            "TEXT 4 0 50 255 浙江省 杭州市 西湖区\n" +
            "TEXT 4 0 50 285 文三路伟星大厦9D\n" +
            "TEXT 2 0 50 360 风先生 15812345678\n" +
            "TEXT 2 0 50 400 上海市 黄浦区 南京西路231号人民公园\n" +
            "BARCODE 128 3 3 70 20 450 000000000000001\n" +
            "TEXT 2 0 100 525 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1\n" +
            "TEXT 55 0 0 570 2018/07/19\n" +
            "TEXT 55 0 10 590 14:11:21\n" +
            "TEXT 2 0 10 610 1/1\n" +
            "TEXT 55 0 10 640 打印时间\n" +
            "TEXT 55 0 120 560 快件送达收件人地址，经收件人或收件人（寄件\n" +
            "TEXT 55 0 120 578 人）允许的代收人签字，视为送达。您的签字代\n" +
            "TEXT 55 0 120 596 表您已验收此包裹，并已确认商品信息无误、\n" +
            "TEXT 55 0 120 614 包装完好、没有划痕、破损等表面质量问题\n" +
            "BOX 120 635 200 665 2\n" +
            "TEXT 5 0 125 637 已验视\n" +
            "TEXT 5 0 380 640 签收栏\n" +
            "TEXT 55 0 470 570 品类:\n" +
            "TEXT 5 0 465 610 服饰\n" +
            "BARCODE 128 1 1 50 280 705 000000000000001\n" +
            "TEXT 2 0 320 760 000000000000001\n" +
            "TEXT 2 0 0 800 收\n" +
            "TEXT 2 0 0 840 件\n" +
            "TEXT 2 0 0 900 寄\n" +
            "TEXT 2 0 0 940 件\n" +
            "TEXT 2 0 50 800 火先生 13800001111\n" +
            "TEXT 2 0 50 840 浙江省 杭州市 西湖区 文三路伟星大厦9D\n" +
            "TEXT 2 0 50 900 风先生 15812345678\n" +
            "TEXT 2 0 50 940 上海市 黄浦区 南京西路231号人民公园\n" +
            "BARCODE 128 1 1 50 280 1025 000000000000001\n" +
            "TEXT 2 0 320 1075 000000000000001\n" +
            "TEXT 2 0 0 1110 收\n" +
            "TEXT 2 0 0 1140 件\n" +
            "TEXT 2 0 0 1190 寄\n" +
            "TEXT 2 0 0 1220 件\n" +
            "TEXT 2 0 50 1105 火先生 13800001111\n" +
            "TEXT 2 0 50 1140 浙江省 杭州市 西湖区 文三路伟星大厦9D\n" +
            "TEXT 2 0 50 1185 风先生 15812345678\n" +
            "TEXT 2 0 50 1220 上海市 黄浦区 南京西路231号人民公园\n" +
            "TEXT 2 0 0 1270 一件衣服（测试打印）\n" +
            "TEXT 55 0 320 1380 打印时间：2018/07/19 14:11:21\n" +
            "SETBOLD 1\n" +
            "FORM\n" +
            "POPRINT\n";



}
